Autodesk.Revit.DB.UV.ToString
Gets formatted string showing (U, V) with values formatted to 9 decimal places.

Autodesk.Revit.DB.UV.AngleTo(Autodesk.Revit.DB.UV)
Returns the angle between this vector and the specified vector.
source: The specified vector.
Returns: The real number between 0 and 2*PI equal to the angle between the two vectors in radians.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when source is null.
Remarks:
The angle is measured counterclockwise.

Autodesk.Revit.DB.UV.DistanceTo(Autodesk.Revit.DB.UV)
Returns the distance from this 2-D point to the specified 2-D point.
source: The specified point.
Returns: The real number equal to the distance between the two points.
Remarks:
The distance between the two points is equal to the length of the vector
that joins the two points.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when source is null.

Autodesk.Revit.DB.UV.IsAlmostEqualTo(Autodesk.Revit.DB.UV,System.Double)
Determines whether this 2-D vector and the specified 2-D vector are the same within a specified tolerance.
source: The vector to compare with this vector.
tolerance: The tolerance for equality check.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when source is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when tolerance is less than 0.
Returns: True if the vectors are the same; otherwise, false.

Autodesk.Revit.DB.UV.IsAlmostEqualTo(Autodesk.Revit.DB.UV)
Determines whether this 2-D vector and the specified 2-D vector are the same within the tolerance (1.0e-09).
source: The vector to compare with this vector.
Returns: True if the vectors are the same; otherwise, false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when left is null.

Autodesk.Revit.DB.UV.Divide(System.Double)
Divides this 2-D vector by the specified value and returns the result.
value: The value to divide this vector by.
Returns: The divided 2-D vector.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the specified value is an infinite number.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the specified value is zero.
Remarks:
The divided vector is obtained by dividing each coordinate of
this vector by the specified value.

Autodesk.Revit.DB.UV.Multiply(System.Double)
Multiplies this 2-D vector by the specified value and returns the result.
value: The value to multiply with this vector.
Returns: The multiplied 2-D vector.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the specified value is an infinite number.
Remarks:
The multiplied vector is obtained by multiplying each coordinate of
this vector by the specified value.

Autodesk.Revit.DB.UV.Negate
Negates this 2-D vector.
Returns: The 2-D vector opposite to this vector.
Remarks:
The negated vector is obtained by changing the sign of each coordinate
of this vector.

Autodesk.Revit.DB.UV.Subtract(Autodesk.Revit.DB.UV)
Subtracts the specified 2-D vector from this 2-D vector and returns the result.
source: The vector to subtract from this vector.
Returns: The 2-D vector equal to the difference between the two vectors.
Remarks:
The subtracted vector is obtained by subtracting each coordinate of
the specified vector from the corresponding coordinate of this vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when left is null.

Autodesk.Revit.DB.UV.Add(Autodesk.Revit.DB.UV)
Adds the specified 2-D vector to this 2-D vector and returns the result.
source: The vector to add to this vector.
Returns: The 2-D vector equal to the sum of the two vectors.
Remarks:
The added vector is obtained by adding each coordinate of the specified vector
to the corresponding coordinate of this vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when source is null.

Autodesk.Revit.DB.UV.CrossProduct(Autodesk.Revit.DB.UV)
The cross product of this 2-D vector and the specified 2-D vector.
source: The vector to multiply with this vector.
Returns: The real number equal to the cross product.
Remarks:
The cross product of the two vectors in 2-D space is equivalent to the area of the parallelogram they span.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when source is null.

Autodesk.Revit.DB.UV.DotProduct(Autodesk.Revit.DB.UV)
The dot product of this 2-D vector and the specified 2-D vector.
source: The vector to multiply with this vector.
Returns: The real number equal to the dot product.
Remarks:
The dot product is the sum of the respective coordinates of the two vectors: Pu * Ru + Pv * Rv.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when source is null.

Autodesk.Revit.DB.UV.op_Division(Autodesk.Revit.DB.UV,System.Double)
Divides the specified 2-D vector by the specified value.
left: The value to divide the vector by.
value: The vector to divide by the value.
Returns: The divided 2-D vector.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the specified value is an infinite number or zero.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when left is null.
Remarks:
The divided vector is obtained by dividing each coordinate of
the specified vector by the specified value.

Autodesk.Revit.DB.UV.op_Multiply(Autodesk.Revit.DB.UV,System.Double)
The product of the specified number and the specified 2-D vector.
left: The vector to multiply with the value.
value: The value to multiply with the specified vector.
Returns: The multiplied 2-D vector.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the specified value is an infinite number.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when left is null.
Remarks:
The multiplied vector is obtained by multiplying each coordinate of
the specified vector by the specified value.

Autodesk.Revit.DB.UV.op_Multiply(System.Double,Autodesk.Revit.DB.UV)
The product of the specified number and the specified 2-D vector.
value: The value to multiply with the specified vector.
right: The vector to multiply with the value.
Returns: The multiplied 2-D vector.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the specified value is an infinite number.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when right is null.
Remarks:
The multiplied vector is obtained by multiplying each coordinate of
the specified vector by the specified value.

Autodesk.Revit.DB.UV.op_UnaryNegation(Autodesk.Revit.DB.UV)
Negates this 2-D vector and returns the result.
Returns: The 2-D vector opposite to this vector.
Remarks:
The negated vector is obtained by changing the sign of each coordinate
of the specified vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when source is null.

Autodesk.Revit.DB.UV.op_Subtraction(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.UV)
Subtracts the two specified 2-D vectors and returns the result.
left: The first vector.
right: The second vector.
Returns: The 2-D vector equal to the difference between the two source vectors.
Remarks:
The subtracted vector is obtained by subtracting each coordinate of
the right vector from the corresponding coordinate of the left vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when left or right is null.

Autodesk.Revit.DB.UV.op_Addition(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.UV)
Adds the two specified 2-D vectors and returns the result.
left: The first vector.
right: The second vector.
Returns: The 2-D vector equal to the sum of the two source vectors.
Remarks:
The added vector is obtained by adding each coordinate of the right vector
to the corresponding coordinate of the left vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when left or right is null.

Autodesk.Revit.DB.UV.IsUnitLength
The boolean value indicates whether this 2-D vector is of unit length.
Remarks:
A unit length vector has a length of one, and is considered normalized.

Autodesk.Revit.DB.UV.IsZeroLength
The boolean value indicates whether this 2-D vector is a zero vector.
Remarks: The zero vector's each component is zero within the tolerance (1.0e-09).

Autodesk.Revit.DB.UV.GetLength
The length of this 2-D vector.
Remarks:
In 2-D Euclidean space, the length of the vector is the square root of the sum
of the two coordinates squared.

Autodesk.Revit.DB.UV.Normalize
Returns a new UV whose coordinates are the normalized values from this vector.
Remarks:
Normalized indicates that the length of this vector equals one
(a unit vector).
Returns: The normalized UV or zero if the vector is almost Zero.

Autodesk.Revit.DB.UV.BasisV
The basis of the V axis.
Remarks: The basis of the V axis is the vector (0,1), the unit vector on the V axis.

Autodesk.Revit.DB.UV.BasisU
The basis of the U axis.
Remarks: The basis of the U axis is the vector (1,0), the unit vector on the U axis.

Autodesk.Revit.DB.UV.Zero
The coordinate origin or zero 2-D vector.
Remarks: The zero vector is (0,0).

Autodesk.Revit.DB.UV.default(System.Int32)
Indexed access to coordinates.
idx: Use 0 for U and 1 for V.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when an attempt is made to access coordinates
with an index that is larger than 1.

Autodesk.Revit.DB.UV.V
Gets the second coordinate.

Autodesk.Revit.DB.UV.U
Gets the first coordinate.

Autodesk.Revit.DB.UV.#ctor(System.Double,System.Double)
Creates a UV with the supplied coordinates.
u: The first coordinate.
v: The second coordinate.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when setting an infinite number to the U or V property.

Autodesk.Revit.DB.UV.#ctor
Creates a default UV with the values (0, 0).

Autodesk.Revit.DB.UV
Object representing coordinates in 2-dimensional space.
Remarks: Usually this means parameters on a surface. In actual use, it could be
interpreted as either point or vector in 2-dimensional space.